In [11]:
# Imports
import pandas as pd

In [12]:
dfs = []

# 1. download small area fmrs from 2015 to 2021
# 2. 2025 - 2022: MODEL DF
# 3. 2021, 2019: Aadi
# 4. 2020: Jay
# 5: 2018 - 2015: Jay

In [13]:
# 2019, 2021
for i in range(19, 22):
    if i == 20:
        continue
    
    df = pd.read_excel(f'datasets/fmrs_{2000 + i}.xlsx')
    df = df[df['HUD Metro Fair Market Rent Area Name'] == 'Washington-Arlington-Alexandria, DC-VA-MD HUD Metro FMR Area']
    df = df.drop(df.columns[[1, 2, 4, 5, 7, 8, 10, 11, 13, 14, 16, 17]], axis=1)
    df = df.reset_index(drop=True)
    
    df = df.rename(columns={
            'ZIP\nCode': 'zip_code',
            'SAFMR\n0BR': '0_bedroom',
            'SAFMR\n1BR': '1_bedroom',
            'SAFMR\n2BR': '2_bedroom',
            'SAFMR\n3BR': '3_bedroom',
            'SAFMR\n4BR': '4_bedroom'
        })
    
    df = df[df['zip_code'] != 88888]
    
    dfs.append(df)

In [14]:
for i in range(22, 26):
    df = pd.read_excel(f'datasets/fmrs_{2000 + i}.xlsx')
    df = df[df['HUD Metro Fair Market Rent Area Name'] == 'Washington-Arlington-Alexandria, DC-VA-MD HUD Metro FMR Area']
    df = df.drop(df.columns[[0, 1]], axis=1)
    df = df.reset_index(drop=True)
    
    df = df.rename(columns={
            'ZIP\nCode': 'zip_code',
            'erap_fmr_br0': '0_bedroom',
            'erap_fmr_br1': '1_bedroom',
            'erap_fmr_br2': '2_bedroom',
            'erap_fmr_br3': '3_bedroom',
            'erap_fmr_br4': '4_bedroom'
        })
    
    df = df[df['zip_code'] != 88888]
    
    dfs.append(df)

/Users/Aadi/Desktop/CMSC320 final project/.venv/lib/python3.11/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")
/Users/Aadi/Desktop/CMSC320 final project/.venv/lib/python3.11/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

In [15]:
for df in dfs:
    display(df)
    
    
    # Washington-Arlington-Alexandria, DC-VA-MD HUD Metro FMR Area
    # Washington-Arlington-Alexandria, DC-VA-MD HUD Metro FMR Area

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       1740       1790       2050       2680       3300
1       20002       1220       1260       1440       1880       2320
2       20003       2120       2180       2500       3270       4020
3       20004       2120       2180       2500       3270       4020
4       20005       2000       2050       2350       3070       3780
..        ...        ...        ...        ...        ...        ...
438     22742       1170       1230       1420       1870       2320
439     22960       1170       1230       1420       1870       2320
440     23015       1170       1230       1420       1870       2320
441     23024       1170       1230       1420       1870       2320
442     23117       1170       1230       1420       1870       2320

[443 rows x 6 columns]

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       2080       2130       2430       3120       3780
1       20002       1330       1360       1550       1990       2410
2       20003       2270       2320       2650       3400       4120
3       20004       2270       2320       2650       3400       4120
4       20005       2160       2210       2520       3230       3910
..        ...        ...        ...        ...        ...        ...
500     22742       1130       1160       1320       1690       2050
501     22960        960       1000       1160       1530       1890
502     23015        960       1000       1160       1530       1890
503     23024        960       1000       1160       1530       1890
504     23117        960       1000       1160       1530       1890

[505 rows x 6 columns]

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       2180       2220       2530       3200       3840
1       20002       1539       1567       1785       2260       2713
2       20003       2310       2350       2680       3390       4070
3       20004       2310       2350       2680       3390       4070
4       20005       2210       2250       2560       3240       3890
..        ...        ...        ...        ...        ...        ...
500     22742       1539       1567       1785       2260       2713
501     22960       1539       1567       1785       2260       2713
502     23015       1539       1567       1785       2260       2713
503     23024       1539       1567       1785       2260       2713
504     23117       1539       1567       1785       2260       2713

[505 rows x 6 columns]

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       2300       2340       2660       3330       3970
1       20002       1589       1615       1838       2299       2742
2       20003       2390       2430       2760       3450       4120
3       20004       2390       2430       2760       3450       4120
4       20005       2200       2240       2550       3190       3800
..        ...        ...        ...        ...        ...        ...
499     22742       1589       1615       1838       2299       2742
500     22960       1589       1615       1838       2299       2742
501     23015       1589       1615       1838       2299       2742
502     23024       1589       1615       1838       2299       2742
503     23117       1589       1615       1838       2299       2742

[504 rows x 6 columns]

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       2460       2500       2840       3530       4190
1       20002       1772       1803       2045       2544       3015
2       20003       2660       2710       3070       3820       4530
3       20004       2610       2650       3010       3740       4440
4       20005       2330       2370       2690       3350       3970
..        ...        ...        ...        ...        ...        ...
500     22742       1772       1803       2045       2544       3015
501     22960       1772       1803       2045       2544       3015
502     23015       1772       1803       2045       2544       3015
503     23024       1772       1803       2045       2544       3015
504     23117       1772       1803       2045       2544       3015

[505 rows x 6 columns]

     zip_code  0_bedroom  1_bedroom  2_bedroom  3_bedroom  4_bedroom
0       20001       2770       2830       3190       3990       4700
1       20002       2050       2100       2360       2950       3480
2       20003       3020       3080       3470       4340       5120
3       20004       2900       2960       3330       4160       4910
4       20005       2520       2580       2900       3630       4280
..        ...        ...        ...        ...        ...        ...
500     22742       2012       2056       2314       2893       3413
501     22960       2012       2056       2314       2893       3413
502     23015       2012       2056       2314       2893       3413
503     23024       2012       2056       2314       2893       3413
504     23117       2012       2056       2314       2893       3413

[505 rows x 6 columns]